# BuiltInFailures.ArrayFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures Class
BuiltInFailures Class Members See Also
---
Failures about Arrays.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ArrayFailures
```

Visual Basic
---
```text
Public NotInheritable Class ArrayFailures
```

Visual C++
---
```text
public ref class ArrayFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ArrayFailures
# See Also
BuiltInFailures..::..ArrayFailures Members
Autodesk.Revit.DB Namespace